# Aula 5: Pandas 2

## Operações com dados
Arrays e matrizes.

### Remoção de itens

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
serie_1 = Series(np.arange(3), index = ['a', 'b', 'c'])
serie_1

a    0
b    1
c    2
dtype: int64

In [3]:
serie_1.drop('c')

a    0
b    1
dtype: int64

In [4]:
data_frame_1 = DataFrame(np.arange(9).reshape((3,3)), index = ["Desktop", "Phone", "Tablet"], 
                        columns = ["Brasil", "Chile", "Peru"])
print(data_frame_1)
data_frame_1

         Brasil  Chile  Peru
Desktop       0      1     2
Phone         3      4     5
Tablet        6      7     8

         Brasil  Chile  Peru
Desktop       0      1     2
Phone         3      4     5
Tablet        6      7     8

In [5]:
print(data_frame_1.drop("Phone"))
data_frame_1.drop("Phone")

         Brasil  Chile  Peru
Desktop       0      1     2
Tablet        6      7     8

         Brasil  Chile  Peru
Desktop       0      1     2
Tablet        6      7     8

In [6]:
print(data_frame_1.drop("Chile", axis=1))
data_frame_1.drop("Chile", axis=1)

         Brasil  Peru
Desktop       0     2
Phone         3     5
Tablet        6     8

         Brasil  Peru
Desktop       0     2
Phone         3     5
Tablet        6     8

### Seleção de itens

In [7]:
serie_1 = Series(np.arange(4), index=['a', 'b', 'c', 'd'])
serie_1

a    0
b    1
c    2
d    3
dtype: int64

In [8]:
serie_2 = serie_1 * 2
serie_2

a    0
b    2
c    4
d    6
dtype: int64

In [9]:
serie_2['b']

2

In [10]:
serie_2[0:3]

a    0
b    2
c    4
dtype: int64

In [11]:
serie_2[['a','c']]

a    0
c    4
dtype: int64

In [12]:
serie_2[serie_2>3]

c    4
d    6
dtype: int64

In [13]:
serie_2[serie_2>3] = 40
serie_2

a     0
b     2
c    40
d    40
dtype: int64

In [14]:
data_frame_1 = DataFrame(np.arange(16).reshape((4,4)), index = ["Brasil", "Peru", "Argentina", "Chile"], 
                         columns = ["2018", "2017", "2016", "2015"])
print(data_frame_1)
data_frame_1

           2018  2017  2016  2015
Brasil        0     1     2     3
Peru          4     5     6     7
Argentina     8     9    10    11
Chile        12    13    14    15

           2018  2017  2016  2015
Brasil        0     1     2     3
Peru          4     5     6     7
Argentina     8     9    10    11
Chile        12    13    14    15

In [15]:
data_frame_1["2018"]

Brasil        0
Peru          4
Argentina     8
Chile        12
Name: 2018, dtype: int64

In [16]:
print(data_frame_1[["2018", "2016"]])
data_frame_1[["2018", "2016"]]

           2018  2016
Brasil        0     2
Peru          4     6
Argentina     8    10
Chile        12    14

           2018  2016
Brasil        0     2
Peru          4     6
Argentina     8    10
Chile        12    14

In [17]:
print(data_frame_1[data_frame_1["2018"]>8])
data_frame_1[data_frame_1["2018"]>8]

       2018  2017  2016  2015
Chile    12    13    14    15

       2018  2017  2016  2015
Chile    12    13    14    15

In [18]:
print(data_frame_1 > 8)
data_frame_1 > 8

            2018   2017   2016   2015
Brasil     False  False  False  False
Peru       False  False  False  False
Argentina  False   True   True   True
Chile       True   True   True   True

            2018   2017   2016   2015
Brasil     False  False  False  False
Peru       False  False  False  False
Argentina  False   True   True   True
Chile       True   True   True   True

In [19]:
data_frame_1.loc["Chile"]

2018    12
2017    13
2016    14
2015    15
Name: Chile, dtype: int64

### Alinhamento de dados

In [20]:
serie_1 = Series([0, 1, 2], index=['a', 'b', 'c'])
serie_1

a    0
b    1
c    2
dtype: int64

In [21]:
serie_2 = Series([3, 4, 5], index=['a', 'c', 'f'])
serie_2

a    3
c    4
f    5
dtype: int64

In [22]:
serie_1 + serie_2

a    3.0
b    NaN
c    6.0
f    NaN
dtype: float64

In [23]:
data_frame_1 = DataFrame(np.arange(4).reshape((2,2)), columns=list("AB"), index= ["SPO", "RJO"])
data_frame_1

     A  B
SPO  0  1
RJO  2  3

In [24]:
data_frame_2 = DataFrame(np.arange(9).reshape((3,3)), columns=list("ADC"), index= ["RGN", "RJO", "SPO"])
data_frame_2

     A  D  C
RGN  0  1  2
RJO  3  4  5
SPO  6  7  8

In [25]:
data_frame_1 + data_frame_2

       A   B   C   D
RGN  NaN NaN NaN NaN
RJO  5.0 NaN NaN NaN
SPO  6.0 NaN NaN NaN

https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.add.html
fill_value : None or float value, default None

Fill missing (NaN) values with this value. If both DataFrame locations are missing, the result will be missing

In [26]:
data_frame_2.add(data_frame_1, fill_value=0)

       A    B    C    D
RGN  0.0  NaN  2.0  1.0
RJO  5.0  3.0  5.0  4.0
SPO  6.0  1.0  8.0  7.0

## Rank e Sort
Ordenação e ranking de dados.

In [27]:
series_1 = Series(range(4), index=["a", "d", "b", "c"])
series_1

a    0
d    1
b    2
c    3
dtype: int64

In [28]:
series_1.sort_index()

a    0
b    2
c    3
d    1
dtype: int64

In [29]:
series_1.sort_values()

a    0
d    1
b    2
c    3
dtype: int64

In [30]:
series_2 = Series(np.random.randn(10))
series_2

0    1.113937
1   -0.077944
2   -0.067559
3    1.152340
4    0.805558
5    0.868797
6    0.893743
7   -0.848075
8    0.423020
9    1.538898
dtype: float64

In [31]:
series_2.sort_values()

7   -0.848075
1   -0.077944
2   -0.067559
8    0.423020
4    0.805558
5    0.868797
6    0.893743
0    1.113937
3    1.152340
9    1.538898
dtype: float64

In [32]:
series_2.rank()

0     8.0
1     2.0
2     3.0
3     9.0
4     5.0
5     6.0
6     7.0
7     1.0
8     4.0
9    10.0
dtype: float64

In [33]:
series_2

0    1.113937
1   -0.077944
2   -0.067559
3    1.152340
4    0.805558
5    0.868797
6    0.893743
7   -0.848075
8    0.423020
9    1.538898
dtype: float64

### Missing & Repeated Values
Técnicas de remoção e imputação de dados

In [34]:
series_1 = Series(['a', 'b', np.nan, 'c', 'd'])
series_1

0      a
1      b
2    NaN
3      c
4      d
dtype: object

In [35]:
series_1.isnull()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [36]:
series_1.dropna()

0    a
1    b
3    c
4    d
dtype: object

In [37]:
data_frame = DataFrame([[1,2,3,4],[5,np.nan,7,np.nan],[np.nan, np.nan, np.nan, 10],
                        [np.nan, np.nan, np.nan, np.nan]], columns=['A','B','C','D'])
print(data_frame)
data_frame

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  NaN  7.0   NaN
2  NaN  NaN  NaN  10.0
3  NaN  NaN  NaN   NaN

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  NaN  7.0   NaN
2  NaN  NaN  NaN  10.0
3  NaN  NaN  NaN   NaN

In [38]:
print(data_frame.dropna())
data_frame.dropna()

     A    B    C    D
0  1.0  2.0  3.0  4.0

     A    B    C    D
0  1.0  2.0  3.0  4.0

In [39]:
print(data_frame.dropna(how="all"))
data_frame.dropna(how="all")

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  NaN  7.0   NaN
2  NaN  NaN  NaN  10.0

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  NaN  7.0   NaN
2  NaN  NaN  NaN  10.0

Linhas com no mínimo de não nulos

In [40]:
print(data_frame.dropna(thresh=1))
data_frame.dropna(thresh=1)

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  NaN  7.0   NaN
2  NaN  NaN  NaN  10.0

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  NaN  7.0   NaN
2  NaN  NaN  NaN  10.0

In [41]:
print(data_frame.dropna(thresh=1))
data_frame.fillna(0)

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  NaN  7.0   NaN
2  NaN  NaN  NaN  10.0

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  0.0  7.0   0.0
2  0.0  0.0  0.0  10.0
3  0.0  0.0  0.0   0.0

In [42]:
print(data_frame.fillna({'A':1,'B':2,'C':3,'D':4}))
data_frame.fillna({'A':1,'B':2,'C':3,'D':4})

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  2.0  7.0   4.0
2  1.0  2.0  3.0  10.0
3  1.0  2.0  3.0   4.0

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  2.0  7.0   4.0
2  1.0  2.0  3.0  10.0
3  1.0  2.0  3.0   4.0

In [43]:
data_frame.mean()

A    3.0
B    2.0
C    5.0
D    7.0
dtype: float64

In [44]:
print(data_frame.fillna(data_frame.mean()))
data_frame.fillna(data_frame.mean())

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  2.0  7.0   7.0
2  3.0  2.0  5.0  10.0
3  3.0  2.0  5.0   7.0

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  2.0  7.0   7.0
2  3.0  2.0  5.0  10.0
3  3.0  2.0  5.0   7.0

In [45]:
print(data_frame.fillna(data_frame.max()))
data_frame.fillna(data_frame.max())

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  2.0  7.0  10.0
2  5.0  2.0  7.0  10.0
3  5.0  2.0  7.0  10.0

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  2.0  7.0  10.0
2  5.0  2.0  7.0  10.0
3  5.0  2.0  7.0  10.0

In [46]:
print(data_frame.fillna(data_frame.min()))
data_frame.fillna(data_frame.min())

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  2.0  7.0   4.0
2  1.0  2.0  3.0  10.0
3  1.0  2.0  3.0   4.0

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  2.0  7.0   4.0
2  1.0  2.0  3.0  10.0
3  1.0  2.0  3.0   4.0

In [47]:
data_frame['A'].fillna(data_frame['A'].mean(), inplace=True)
print(data_frame)
data_frame

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  NaN  7.0   NaN
2  3.0  NaN  NaN  10.0
3  3.0  NaN  NaN   NaN

     A    B    C     D
0  1.0  2.0  3.0   4.0
1  5.0  NaN  7.0   NaN
2  3.0  NaN  NaN  10.0
3  3.0  NaN  NaN   NaN

Itens repetidos

In [71]:
data_frame_1 = DataFrame({"Coluna 1":["A"]*3 + ["B"]*2, "Coluna 2":[1,2,2,3,4]})
data_frame_1

  Coluna 1  Coluna 2
0        A         1
1        A         2
2        A         2
3        B         3
4        B         4

In [72]:
data_frame_1.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [73]:
data_frame_1.drop_duplicates()

  Coluna 1  Coluna 2
0        A         1
1        A         2
3        B         3
4        B         4

In [74]:
data_frame_1.drop_duplicates(["Coluna 1"])

  Coluna 1  Coluna 2
0        A         1
3        B         3

In [75]:
data_frame_1.drop_duplicates(["Coluna 2"])

  Coluna 1  Coluna 2
0        A         1
1        A         2
3        B         3
4        B         4

In [76]:
data_frame_1.drop_duplicates(keep="last")

  Coluna 1  Coluna 2
0        A         1
2        A         2
3        B         3
4        B         4

Replace

In [85]:
serie_1 = Series([1,2,3,4,5,6])
serie_1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [95]:
serie_1.replace(1,np.nan)

0    NaN
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

In [96]:
serie_1.replace([2,3],[200,300])

0      1
1    200
2    300
3      4
4      5
5      6
dtype: int64

In [97]:
serie_1.replace({4: np.nan})

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
dtype: float64